In [1]:
import pandas as pd
import numpy as np
days = pd.Series(['Monday', 'Tuesday', 'Wednessday', 'Thursday','Friday'])
print(days)

0        Monday
1       Tuesday
2    Wednessday
3      Thursday
4        Friday
dtype: object

In [2]:
#you can create list on pandas with numpy array

days_list = np.array(['Monday', 'Tuesday', 'Wednessday'])
numpy_days = pd.Series(days_list)
print(numpy_days)

0        Monday
1       Tuesday
2    Wednessday
dtype: object

In [3]:
#using strings as index
days = pd.Series(['Monday', 'Tuesday', 'Wednessday'], index = ['a', 'b', 'c'])

#you can also create series from dictionary
days1 = pd.Series({'a': 'Monday', 'b': 'Tuesday', 'c':'Wednessday'})

print(days)

a        Monday
b       Tuesday
c    Wednessday
dtype: object

In [4]:
days1

a        Monday
b       Tuesday
c    Wednessday
dtype: object

In [5]:
days[0]

'Monday'

In [6]:
days[1:]

b       Tuesday
c    Wednessday
dtype: object

In [7]:
days[1]

'Tuesday'

In [8]:
days['b']

'Tuesday'

In [9]:
days[:2]

a     Monday
b    Tuesday
dtype: object

In [10]:
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [11]:
#dataframe from dictionary

df_dict = {'Country': ['Ghana', 'Kenya', 'Nigeria', 'Togo'],
           'Capital': ['Accra', 'Nairobi', 'Abuja', 'Lome'],
           'Population':[10000, 8500,35000,12000],
           'Age': [60,70,80,75]
    
}
index= [2,4,6,8]
df = pd.DataFrame(df_dict,index)
df_list =[['Ghana', 'Accra', 10000,60],
          ['Kenya','Nairobi', 8500,70],
          ['Nigeria','Abuja',35000,80],
          ['Togo', 'Lome',12000,75]]
df1 = pd.DataFrame(df_list, columns=['Country','Capital','Population','Age'], index= [2,4,6,8])

df

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75

In [12]:
df1

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75

In [13]:
df

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75

In [14]:
# select row using index 3
df.iloc[3]

Country        Togo
Capital        Lome
Population    12000
Age              75
Name: 8, dtype: object

In [15]:
#select row using label 8
df.loc[8]

Country        Togo
Capital        Lome
Population    12000
Age              75
Name: 8, dtype: object

In [16]:
df.loc[6]

Country       Nigeria
Capital         Abuja
Population      35000
Age                80
Name: 6, dtype: object

In [17]:
df.loc[4]

Country         Kenya
Capital       Nairobi
Population       8500
Age                70
Name: 4, dtype: object

In [18]:
df.iloc[1]

Country         Kenya
Capital       Nairobi
Population       8500
Age                70
Name: 4, dtype: object

In [19]:
#slecting the coloumn
df['Capital']

2      Accra
4    Nairobi
6      Abuja
8       Lome
Name: Capital, dtype: object

In [20]:
#getting single value with 'at'
#recognise it uses row label and column
#note that the row label comes first 

df.at[6, 'Country']

'Nigeria'

In [21]:
#getting single value with 'iat'
#recognise it uses indices
#note that the column indices comes firstfollowed by row indices 

df.iat[3,3]

75

In [22]:
df.iat[2,0]

'Nigeria'

In [23]:
#Arithemetic functions 

df['Population'].sum()

65500

In [27]:
df.mean()

Population    16375.00
Age              71.25
dtype: float64

In [28]:
df['Population'].mean()

16375.0

In [ ]:
df.describe()

In [26]:
df.sum()

Country       GhanaKenyaNigeriaTogo
Capital       AccraNairobiAbujaLome
Population                    65500
Age                             285
dtype: object

In [25]:
df.describe()

         Population        Age
count      4.000000   4.000000
mean   16375.000000  71.250000
std    12499.166639   8.539126
min     8500.000000  60.000000
25%     9625.000000  67.500000
50%    11000.000000  72.500000
75%    17750.000000  76.250000
max    35000.000000  80.000000

In [29]:
df['Population'].describe()

count        4.000000
mean     16375.000000
std      12499.166639
min       8500.000000
25%       9625.000000
50%      11000.000000
75%      17750.000000
max      35000.000000
Name: Population, dtype: float64

In [34]:
#working with misisng values and data 

df_dict2 = { 'Name': ['James', 'Yemen', 'Caro', np.NaN],
            'Profession': ["Researcher", 'Artist', 'Doctor', 'Writer'],
            'Experience': [12, np.NaN, 10, 8],
            'Height': [np.NaN, 175, 180, 150]   
}
new_df = pd.DataFrame(df_dict2)
new_df

    Name  Profession  Experience  Height
0  James  Researcher        12.0     NaN
1  Yemen      Artist         NaN   175.0
2   Caro      Doctor        10.0   180.0
3    NaN      Writer         8.0   150.0

In [35]:
#checking for the missing value as True

new_df.isnull()

    Name  Profession  Experience  Height
0  False       False       False    True
1  False       False        True   False
2  False       False       False   False
3   True       False       False   False

In [36]:
#eliminating row with missing value 

new_df.dropna()

   Name Profession  Experience  Height
2  Caro     Doctor        10.0   180.0

In [37]:
new_df

    Name  Profession  Experience  Height
0  James  Researcher        12.0     NaN
1  Yemen      Artist         NaN   175.0
2   Caro      Doctor        10.0   180.0
3    NaN      Writer         8.0   150.0

In [39]:
new_df.notnull()

    Name  Profession  Experience  Height
0   True        True        True   False
1   True        True       False    True
2   True        True        True    True
3  False        True        True    True

In [40]:
new_df.dropna()

   Name Profession  Experience  Height
2  Caro     Doctor        10.0   180.0

In [45]:

df_dict2 = { 'Name': ['James', 'Yemen', 'Caro', np.NaN],
            'Profession': ["Researcher", 'Artist', 'Doctor', 'Writer'],
            'Experience': [12, np.NaN, 10, 8],
            'Height': [np.NaN, 175, 180, 150]   
}
index= ['a', 'b', 'c', 'd']
new_df = pd.DataFrame(df_dict2, index)
print(new_df)

    Name  Profession  Experience  Height
a  James  Researcher        12.0     NaN
b  Yemen      Artist         NaN   175.0
c   Caro      Doctor        10.0   180.0
d    NaN      Writer         8.0   150.0

In [46]:
new_df.isnull()

    Name  Profession  Experience  Height
a  False       False       False    True
b  False       False        True   False
c  False       False       False   False
d   True       False       False   False

In [47]:
new_df.dropna()

   Name Profession  Experience  Height
c  Caro     Doctor        10.0   180.0